ГСЧ = Новый ГенераторСлучайныхЧисел();
ВозможныеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ123456789.,!";
ДлинаПароля = 0;
КолвоПаролей = 0;
ВвестиЧисло(ДлинаПароля);
ВвестиЧисло(КолвоПаролей);
СписокПаролей = "";
Для Ш1 = 1 По КолвоПаролей Цикл
	Пароль = "";
	Для Ш2 = 1 По ДлинаПароля Цикл
		Пароль = Пароль + Сред(ВозможныеСимволы, ГСЧ.СлучайноеЧисло(1, СтрДлина(ВозможныеСимволы)), 1);
	КонецЦикла;
	СписокПаролей = СписокПаролей + Пароль + Символы.ПС;
КонецЦикла;
ОткрытьЗначение(СписокПаролей);