
// Модуль уроки
Процедура ВыводМассива(А) Экспорт
	Р = "";
	Для Ш = 0 По 9 Цикл
		Р = Р + А[Ш] + " ";
	КонецЦикла;
	Сообщить(Р);
КонецПроцедуры

Процедура ПеремешатьМассив(А) Экспорт
	Для Ш = 0 По 4 Цикл
		А[Ш] = А[9 - Ш]
	КонецЦикла;
КонецПроцедуры

Процедура СортироватьМассив(А) Экспорт
	Для Шаг1 = 0 По 8 Цикл
		Для Шаг2 = 0 По 8 - Шаг1 Цикл
			Если А[Шаг2 + 1] < А[Шаг2] Тогда
				Стакан = А[Шаг2 + 1];
				А[Шаг2 + 1] = А[Шаг2];
				А[Шаг2] = Стакан;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры

// Основной модуль
А = Новый Массив(10);
ГСЧ = Новый ГенераторСлучайныхЧисел;
Для Ш = 0 По 9 Цикл
	А[Ш] = ГСЧ.СлучайноеЧисло(1, 10);
КонецЦикла;
Уроки.ВыводМассива(А);
Уроки.ПеремешатьМассив(А);
Уроки.ВыводМассива(А);
Уроки.СортироватьМассив(А);
Уроки.ВыводМассива(А);
