&НаКлиенте
Перем Поле;

&НаКлиенте
Процедура НажатиеНаКнопку(Команда)
	ТекущийЭлемент.Заголовок = "0";
	ИмяНажатойКнопки = ТекущийЭлемент.Имя;
	Идентификатор = Прав(ИмяНажатойКнопки, 2);
	НомерСтроки = Число(Сред(Идентификатор, 1, 1));
	НомерСтолбца = Число(Сред(Идентификатор, 2, 1));
	Поле[НомерСтроки][НомерСтолбца] = "0";
	Если ИграОкончена() Тогда
		ПоказатьПредупреждение(, "Вы победили комптютер!");
	Иначе
		ХодКомпьютера();
		Если ИграОкончена() Тогда
			ПоказатьПредупреждение(, "Компьютер одолел вас!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ХодКомпьютера()
	Для П = 0 По 2 Цикл
		Для Д = 0 По 2 Цикл
			Если Поле[П][Д] = "" Тогда
				Поле[П][Д] = "х";
				ИмяКнопки = "Кнопка" + П + Д;
				Элементы[ИмяКнопки].Заголовок = "х";
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Поле = Новый Массив;
	Поле.Добавить(Новый Массив(3));
	Поле.Добавить(Новый Массив(3));
	Поле.Добавить(Новый Массив(3));
	Для П = 0 По 2 Цикл
		Для Д = 0 По 2 Цикл
			Поле[П][Д] = "";
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ИграОкончена()
	Если
		Поле[0][0] <> "" И
		Поле[0][0] = Поле[0][1] И
		Поле[0][0] = Поле[0][2]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[1][0] <> "" И
		Поле[1][0] = Поле[1][1] И
		Поле[1][0] = Поле[1][2]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[2][0] <> "" И
		Поле[2][0] = Поле[2][1] И
		Поле[2][0] = Поле[2][2]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[0][0] <> "" И
		Поле[0][0] = Поле[1][0] И
		Поле[0][0] = Поле[2][0]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[0][1] <> "" И
		Поле[0][1] = Поле[1][1] И
		Поле[0][1] = Поле[2][1]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[0][2] <> "" И
		Поле[0][2] = Поле[1][2] И
		Поле[0][2] = Поле[2][2]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[0][0] <> "" И
		Поле[0][0] = Поле[1][1] И
		Поле[0][0] = Поле[2][2]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Если
		Поле[0][2] <> "" И
		Поле[0][2] = Поле[1][1] И
		Поле[0][2] = Поле[2][0]
	Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции;
