Стр = "";
ВвестиСтроку(Стр);
КолвоСлов = 0;
КолвоПробелов = 0;
КолвоЗнаков = 0;
Флаг = Ложь;
Для Шаг = 1 По СтрДлина(Стр) Цикл
	Если Сред(Стр, Шаг, 1) = " " ИЛИ СтрНайти(",.!?", Сред(Стр, Шаг, 1)) > 0 Тогда
		Если Флаг = Истина Тогда
			КолвоСлов = КолвоСлов + 1;
		КонецЕсли;
		Флаг = Ложь;
		Если Сред(Стр, Шаг, 1) = " " Тогда
			КолвоПробелов = КолвоПробелов + 1;
		Иначе
			КолвоЗнаков = КолвоЗнаков + 1;
		КонецЕсли;
	Иначе
		Флаг = Истина;
	КонецЕсли;
КонецЦикла;

Если Флаг = Истина Тогда
	КолвоСлов = КолвоСлов + 1;
КонецЕсли;

ОткрытьЗначение("Слов " + КолвоСлов + " пробелов " + КолвоПробелов + " знаков препинания " + КолвоЗнаков);