
&НаКлиенте
Процедура Поиск(Команда)
	ПоискНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПоискНаСервере()
	СамыйДорогойПодарок = Справочники.Подарки.ПустаяСсылка();
	Выборка = Справочники.Подарки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если
			СамыйДорогойПодарок.Пустая() ИЛИ
			Выборка.Цена > СамыйДорогойПодарок.Цена
		Тогда
			СамыйДорогойПодарок = Выборка.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Элементы.НадписьПодарок.Заголовок = СамыйДорогойПодарок.Наименование;
	Элементы.НадписьЦена.Заголовок = СамыйДорогойПодарок.Цена;
КонецПроцедуры