// Задание 4


// Вариант 1

Сообщить("Буря мглою небо кроет,")
;
Сообщить("Вихри снежные крутя;");
Сообщить("То, как зверь, она завоет,");
Сообщить("То заплачет, как дитя.");

// Вариант 2
Сообщить("Буря мглою небо кроет,")
;
Сообщить("Вихри снежные крутя;")
;
Сообщить("То, как зверь, она завоет,")
;
Сообщить(
	"То заплачет, как дитя.");

// Вариант 3
Сообщить(
	"Буря мглою небо кроет,"
	);
Сообщить("Вихри снежные крутя;")
;
Сообщить(
	"То, как зверь, она завоет,"
	);
Сообщить("То заплачет, как дитя.");

// Вариант 4
Сообщить("Буря мглою небо кроет,");Сообщить("Вихри снежные крутя;");Сообщить("То, как зверь, она завоет,");Сообщить("То заплачет, как дитя.");
// Вариант 5
Сообщить("Буря мглою небо кроет,")
;
Сообщить("Вихри снежные крутя;"
);
Сообщить("То, как зверь, она завоет,"
);
Сообщить("То заплачет, как дитя.");

// Вариант 6
Сообщить("Буря мглою небо кроет,")
;Сообщить("Вихри снежные крутя;"
);

Сообщить(
	"То, как зверь, она завоет,");
Сообщить("То заплачет, как дитя.");
