// Вариант 1
Человек = Новый Структура("Цвет, Фильм, ВремяГода");
ВвестиСтроку(Человек.Цвет);
ВвестиСтроку(Человек.Фильм);
ВвестиСтроку(Человек.ВремяГода);
ОткрытьЗначение("Ваш любимый цвет " + Человек.Цвет + ", Ваш любимый фильм " + Человек.Фильм + ", Ваше любимое время года " + Человек.ВремяГода);

// Вариант 2
Мас = Новый Массив(3);
ВвестиСтроку(Мас[0]);
ВвестиСтроку(Мас[1]);
ВвестиСтроку(Мас[2]);
ОткрытьЗначение("Ваш любимый цвет " + Мас[0] + ", Ваш любимый фильм " + Мас[1] + ", Ваше любимое время года " + Мас[2]);

// Вариант 3
Список = Новый СписокЗначений();
Список.Добавить("");
Список.Добавить("");
Список.Добавить("");
Для Каждого Элемент Из Список Цикл
	ВвестиСтроку(Элемент.Значение);
КонецЦикла;
ОткрытьЗначение("Ваш любимый цвет " + Список[0].Значение + ", Ваш любимый фильм " + Список[1].Значение + ", Ваше любимое время года " + Список[2].Значение);