// Вариант 1
Структ = Новый Структура();
Структ.Вставить("С1", "ПолетГагарина");
Структ.Вставить("Г1", 1961);
Структ.Вставить("С2", "Отмена крепостного права в России");
Структ.Вставить("Г2", 1861);
Структ.Вставить("С3", "Крещение Руси");
Структ.Вставить("Г3", 988);
Структ.Вставить("С4", "Распад СССР");
Структ.Вставить("Г4", 1991);
Структ.Вставить("С5", "Окончание Великой Отечественной войны");
Структ.Вставить("Г5", 1945);
Структ.Вставить("С6", "Основание Руси");
Структ.Вставить("Г6", 862);
Год = 0;
ВвестиЧисло(Год);
Если Год = Структ.Г1 Тогда 
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С1);
ИначеЕсли Год = Структ.Г2 Тогда
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С2);
ИначеЕсли Год = Структ.Г3 Тогда
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С3);
ИначеЕсли Год = Структ.Г4 Тогда
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С4);
ИначеЕсли Год = Структ.Г5 Тогда
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С5);
ИначеЕсли Год = Структ.Г6 Тогда
	ОткрытьЗначение("В " + Год + " году был(о) " + Структ.С6);
КонецЕсли;

// Вариант 2
МассивДат = Новый Массив(6);
МассивСобытий = Новый Массив(6);
МассивДат[0] = 1961;
МассивДат[1] = 1861;
МассивДат[2] = 988;
МассивДат[3] = 1991;
МассивДат[4] = 1945;
МассивДат[5] = 862;
МассивСобытий[0] = "Полет Гагарина";
МассивСобытий[1] = "Отмена крепостного права в России";
МассивСобытий[2] = "Крещение Руси";
МассивСобытий[3] = "Распад СССР";
МассивСобытий[4] = "Окончание Великой Отечественной войны";
МассивСобытий[5] = "Основание Руси";
Год = 0;
ВвестиЧисло(Год);
Ш = 0;
Для Каждого Элемент Из МассивДат Цикл
	Если Элемент = Год Тогда 
		ОткрытьЗначение("В " + Год + " году был(о) " + МассивСобытий[Ш]);
	КонецЕсли;
	Ш = Ш + 1;
КонецЦикла;

// Вариант 3
Список = Новый СписокЗначений();
Список.Добавить(1961, "Полет Гагарина");
Список.Добавить(1861, "Отмена крепостного права в России");
Список.Добавить(988, "Крещение Руси");
Список.Добавить(1991, "Распад СССР");
Список.Добавить(1945, "Окончание Великой Отечественной войны");
Список.Добавить(862, "Основание Руси");
Год = 0;
ВвестиЧисло(Год);
Для Каждого Элемент Из Список Цикл
	Если Элемент.Значение = Год Тогда
		ОткрытьЗначение("В " + Год + " году был(о) " + Элемент.Представление);
	КонецЕсли;
КонецЦикла;