// основной модуль
дейт = '00010101';
ВвестиДату(дейт);
текМес = Месяц(ТекущаяДата());
текДень = День(ТекущаяДата());
деньРождения = Дата(Год(ТекущаяДата()), Месяц(дейт), День(дейт));
Если текМес > Месяц(дейт) Тогда
	ОткрытьЗначение("Ваш день рождения уже прошел!");
ИначеЕсли текМес < Месяц(дейт) Тогда
	ОткрытьЗначение("Количество секунд до дня рождения = " + (деньРождения - ТекущаяДата()));
Иначе
	Если текДень > День(дейт) Тогда
		ОткрытьЗначение("Ваш день рождения уже прошел!");
	ИначеЕсли текДень < День(дейт) Тогда
		ОткрытьЗначение("Количество секунд до дня рождения = " + (деньРождения - ТекущаяДата()));
	Иначе
		ОткрытьЗначение("Ваш день рождения сегодня!");
	КонецЕсли;
КонецЕсли;