
// модуль уроки
Функция ПолучитьДеньНедели(дата) Экспорт
	НомерДня = ДеньНедели(дата);
	рез = "";
	Если НомерДня = 1 Тогда
		рез = "понедельник";
	ИначеЕсли НомерДня = 2 Тогда
		рез = "вторник";
	ИначеЕсли НомерДня = 3 Тогда
		рез = "среда";
	ИначеЕсли НомерДня = 4 Тогда
		рез = "четверг";
	ИначеЕсли НомерДня = 5 Тогда
		рез = "пятница";
	ИначеЕсли НомерДня = 6 Тогда
		рез = "суббота";
	ИначеЕсли НомерДня = 7 Тогда
		рез = "воскресенье";
	КонецЕсли;
	Возврат рез;
КонецФункции

// основной модуль
Сегодня = ТекущаяДата();
Сообщить(Уроки.ПолучитьДеньНедели(Сегодня));